<img style="float: left;;" src='../Figures/iteso.jpg' width="50" height="100"/></a>

# <center> <font color= #000047> Repaso de la Librería Pandas</font> </center>

# Groupby

El método groupby nos permite agrupar filas de datos y utilizar funciones de agregación

In [1]:
import pandas as pd
import numpy as np

In [5]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charly','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,243,350,124]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

<strong>Ahora podemos utilizar el método .groupby () para agrupar filas en función del nombre de una columna. <br> Por ejemplo, agrupemos según la empresa. Esto creará un objeto DataFrameGroupBy:</strong>

In [7]:
by_comp = df.groupby('Company')

In [8]:
by_comp

podemos guardar este objeto en una nueva variable:

Y luego podemos utilizar algún metodo de agregación.

In [10]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

In [9]:
by_comp.mean()

         Sales
Company
FB       237.0
GOOG     160.0
MSFT     291.5

In [19]:
df_max = by_comp.max()
df_max

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [20]:
df_max.reset_index()

  Company   Person  Sales
0      FB    Sarah    350
1    GOOG      Sam    200
2    MSFT  Vanessa    340

In [21]:
df_max

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [22]:
df_max.reset_index(inplace=True)

In [23]:
df_max

  Company   Person  Sales
0      FB    Sarah    350
1    GOOG      Sam    200
2    MSFT  Vanessa    340

In [18]:
df_max.max()

Company       MSFT
Person     Vanessa
Sales          350
dtype: object

In [27]:
df[df['Sales']==df_max['Sales'].max()]

  Company Person  Sales
4      FB   Carl    350

In [31]:
df[df['Sales']==df_max['Sales'].max()]

  Company Person  Sales
4      FB   Carl    350

In [32]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

In [34]:
df_mean = df.groupby('Company').mean()

In [35]:
df_mean

         Sales
Company
FB       237.0
GOOG     160.0
MSFT     291.5

In [36]:
df_mean.reset_index(inplace=True)

In [37]:
df_mean

  Company  Sales
0      FB  237.0
1    GOOG  160.0
2    MSFT  291.5

In [38]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

In [41]:
df_fb = df[df['Company']=='FB']
df_fb

  Company Person  Sales
4      FB   Carl    350
5      FB  Sarah    124

In [54]:
fb_mean = df_mean[df_mean['Company']=='FB']['Sales']
fb_mean.values[0]

237.0

In [55]:
df_fb[df_fb['Sales']<fb_mean.values[0]]

  Company Person  Sales
5      FB  Sarah    124